{
  "id": "prod_KG4DM35yPmUYXv",
  "handle": "softcover-small-book",
  "body": "***What happens when a friendship develops between the daughter of a rich Wiseman and a common shepherd girl?***\n\n**This Christmas poem weaves the heartwarming fictional journey of an unlikely friendship into the traditional Biblical account of Jesus’ birth and tells how the arrival of the Savior challenges the heart of one girl to choose love over the acceptable social norm of her day, in a culture marked by rigid distinctions between social classes. Through this story, children will learn to value diversity, acceptance, and love of others regardless of their social status. Based on a ballet production, whimsical drawings will captivate readers and bring a charming twist to a classic Christmas story. Parents and children alike will love the lessons on friendship received through this delightful tale.**\n\nSoftcover 8.25 x 6 inches\n\n\"I whole-heartedly endorse the First Noel. Such a magical telling of the story of Jesus' birth. The poetry flows like a dance within your mind as you go through the incredible imagery. This deserves a spot on your bookshelf and to be read annually. I see this book becoming a tradition within families to read together the story of our savior.\" **\\-*Brae Wyckoff-Director of Kingdom Writers Association and award-winning Amazon bestselling author***\n\n\"The First Noel is a Christmas story for all ages. It reminds us of Christ's greatest two commandments, loving God and loving people, while making sure we understand that all are welcome to enter his kingdom, regardless of our differences.\" ***\\-Theresa Harvard Johnson, Author of The Scribal Anointing book series***\n\n\"The First Noel is a Tale of Friendship woven through the fabric of scripture, combining the most ancient means of expression - DANCE! The illustrations bring the characters to life with movement and  a heartfelt message expressing the good and the bad in human nature that is relevant now and since the beginning of time - stop judging and continue loving.\" -***Faith Jensen-Ismay, Founder and Artistic Director of Mojalet Dance Collective***",
  "images": [
    {
      "href": "/uploads/the-first-noel-backcover.jpg",
      "label": "backcover Children's Christmas story instilling character in children loving others"
    },
    {
      "href": "/uploads/the-first-noel-front-cover.jpg",
      "label": "The First Noel A Tale of Friendship small softcover book Children's Christmas gift ballet dance inclusion diversity poetry"
    },
    {
      "href": "/uploads/stocking.webp",
      "label": "Christmas family traditions friendship Christ centered Christmas stocking stuffer ballet lovers"
    }
  ]
}